doublemarkpro/ESP32-HanDictionary/main/boards/m5stack/tab5/m5stack_tab5.cc
#include "application.h"
#include "button.h"
#include "display/lcd_display.h"
#include "esp_cam_sensor_xclk.h"
#include "esp_lcd_ili9881c.h"
#include "esp_lcd_st7121.h"
#include "esp_lcd_st7123.h"
#include "esp_video.h"
#include "esp_video_init.h"
#include "tab5_audio_codec.h"
#include "wifi_board.h"

// config.h declares panel initialization tables using the driver types above.
#include "config.h"

#include <driver/gpio.h>
#include <driver/i2c_master.h>
#include <driver/spi_common.h>
#include <esp_idf_version.h>
#include <esp_lcd_panel_vendor.h>
#include <esp_log.h>
#include <sys/time.h>
#include <algorithm>
#include <array>
#include <cstdlib>
#include <cstring>
#include <ctime>
#include <memory>
#include "esp_check.h"
#include "esp_lcd_mipi_dsi.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_touch_gt911.h"
#include "esp_lcd_touch_st7123.h"
#include "esp_ldo_regulator.h"
#include "i2c_device.h"

#if CONFIG_HAN_DICTIONARY
#include "dictionary_service.h"
#include "driver/sdspi_host.h"
#include "esp_vfs_fat.h"
#include "hal/usb_wrap_ll.h"
#include "han_display.h"
#include "mcp_server.h"
#include "sdmmc_cmd.h"
#include "soc/usb_wrap_struct.h"
#include "tab5_keyboard.h"
#include "tinyusb.h"
#include "tinyusb_default_config.h"
#include "tinyusb_msc.h"
#include "tusb.h"
using Tab5ProductDisplay = HanDisplay;
// Render a page before copying it to the panel. A 50-line buffer repeats the
// landscape scene traversal about 26 times and visibly paints it in strips.
static constexpr MipiLcdDisplayConfig kTab5DisplayConfig = {
    .buffer_pixels = DISPLAY_WIDTH * DISPLAY_HEIGHT,
    .buffer_in_psram = true,
};
#else
using Tab5ProductDisplay = MipiLcdDisplay;
static constexpr MipiLcdDisplayConfig kTab5DisplayConfig = {};
#endif

#define TAG "M5StackTab5Board"

#define AUDIO_CODEC_ES8388_ADDR ES8388_CODEC_DEFAULT_ADDR
#define LCD_MIPI_DSI_PHY_PWR_LDO_CHAN 3  // LDO_VO3 is connected to VDD_MIPI_DPHY
#define LCD_MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV 2500
#define SD_CARD_PWR_LDO_CHAN 4  // LDO_VO4 supplies the microSD I/O rail on Tab5
#define SD_CARD_PWR_LDO_VOLTAGE_MV 3300
#define ST712X_TOUCH_I2C_ADDRESS 0x55

#if CONFIG_HAN_DICTIONARY
// The Tab5 microSD socket is wired over a relatively long SPI path. At the SDSPI default
// 20 MHz, sustained bursts (for example, decoding all weather PNGs) intermittently return
// ESP_ERR_INVALID_RESPONSE/ESP_ERR_TIMEOUT and leave every later SD-backed asset unreadable.
// 8 MHz is still fast enough for the UI while providing the margin this board needs.
static constexpr int kContentCardFrequencyKHz = 8 * 1000;
#endif

enum class St712xPanel {
    kSt7121,
    kSt7123,
};

// PI4IO registers
#define PI4IO_REG_CHIP_RESET 0x01
#define PI4IO_REG_IO_DIR 0x03
#define PI4IO_REG_OUT_SET 0x05
#define PI4IO_REG_OUT_H_IM 0x07
#define PI4IO_REG_IN_DEF_STA 0x09
#define PI4IO_REG_PULL_EN 0x0B
#define PI4IO_REG_PULL_SEL 0x0D
#define PI4IO_REG_IN_STA 0x0F
#define PI4IO_REG_INT_MASK 0x11
#define PI4IO_REG_IRQ_STA 0x13

// Bit manipulation macros
#define setbit(x, bit) ((x) |= (1U << (bit)))
#define clrbit(x, bit) ((x) &= ~(1U << (bit)))

class Pi4ioe1 : public I2cDevice {
public:
    Pi4ioe1(i2c_master_bus_handle_t i2c_bus, uint8_t addr) : I2cDevice(i2c_bus, addr) {
        WriteReg(PI4IO_REG_CHIP_RESET, 0xFF);
        ReadReg(PI4IO_REG_CHIP_RESET);
        WriteReg(PI4IO_REG_IO_DIR, 0b01111111);      // 0: input 1: output
        WriteReg(PI4IO_REG_OUT_H_IM, 0b00000000);    // 使用到的引脚关闭 High-Impedance
        WriteReg(PI4IO_REG_PULL_SEL, 0b01111111);    // pull up/down select, 0 down, 1 up
        WriteReg(PI4IO_REG_PULL_EN, 0b01111111);     // pull up/down enable, 0 disable, 1 enable
        WriteReg(PI4IO_REG_IN_DEF_STA, 0b10000000);  // P1, P7 默认高电平
        WriteReg(PI4IO_REG_INT_MASK, 0b01111111);    // P7 中断使能 0 enable, 1 disable
        WriteReg(PI4IO_REG_OUT_SET, 0b01110110);  // Output Port Register P1(SPK_EN), P2(EXT5V_EN),
                                                  // P4(LCD_RST), P5(TP_RST), P6(CAM)RST 输出高电平
    }

    uint8_t ReadOutSet() { return ReadReg(PI4IO_REG_OUT_SET); }
    void WriteOutSet(uint8_t value) { WriteReg(PI4IO_REG_OUT_SET, value); }
};

class Pi4ioe2 : public I2cDevice {
public:
    Pi4ioe2(i2c_master_bus_handle_t i2c_bus, uint8_t addr) : I2cDevice(i2c_bus, addr) {
        WriteReg(PI4IO_REG_CHIP_RESET, 0xFF);
        ReadReg(PI4IO_REG_CHIP_RESET);
        WriteReg(PI4IO_REG_IO_DIR, 0b10111001);      // 0: input 1: output
        WriteReg(PI4IO_REG_OUT_H_IM, 0b00000110);    // 使用到的引脚关闭 High-Impedance
        WriteReg(PI4IO_REG_PULL_SEL, 0b10111001);    // pull up/down select, 0 down, 1 up
        WriteReg(PI4IO_REG_PULL_EN, 0b11111001);     // pull up/down enable, 0 disable, 1 enable
        WriteReg(PI4IO_REG_IN_DEF_STA, 0b01000000);  // P6 默认高电平
        WriteReg(PI4IO_REG_INT_MASK, 0b10111111);    // P6 中断使能 0 enable, 1 disable
        WriteReg(PI4IO_REG_OUT_SET, 0b10001001);     // Output Port Register P0(WLAN_PWR_EN),
                                                     // P3(USB5V_EN), P7(CHG_EN) 输出高电平
    }

    uint8_t ReadOutSet() { return ReadReg(PI4IO_REG_OUT_SET); }
    void WriteOutSet(uint8_t value) { WriteReg(PI4IO_REG_OUT_SET, value); }
    bool ReadInput(uint8_t& value) {
        uint8_t reg = PI4IO_REG_IN_STA;
        return i2c_master_transmit_receive(i2c_device_, &reg, 1, &value, 1, 100) == ESP_OK;
    }
};

class Tab5Rtc {
public:
    bool Initialize(i2c_master_bus_handle_t bus) {
        i2c_device_config_t config = {
            .dev_addr_length = I2C_ADDR_BIT_LEN_7,
            .device_address = 0x32,
            .scl_speed_hz = 400 * 1000,
            .scl_wait_us = 0,
            .flags = {},
        };
        auto err = i2c_master_bus_add_device(bus, &config, &device_);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Could not attach RX8130CE RTC: %s", esp_err_to_name(err));
            return false;
        }

        // RX8130CE startup sequence used by M5Unified: select the 32 kHz compensation mode and
        // leave alarm/timer interrupts disabled. The calendar registers are intentionally kept.
        uint8_t extension = 0;
        if (!ReadRegister(0x1f, extension) || !WriteRegister(0x1f, extension | 0x30) ||
            !WriteRegister(0x30, 0x00) || !WriteRegister(0x1e, 0x00)) {
            ESP_LOGW(TAG, "Could not initialize RX8130CE RTC");
            i2c_master_bus_rm_device(device_);
            device_ = nullptr;
            return false;
        }
        return true;
    }

    bool ReadTime(time_t& value) const {
        std::array<uint8_t, 7> registers{};
        if (device_ == nullptr || !ReadRegisters(0x10, registers.data(), registers.size()))
            return false;
        const uint8_t second_bcd = registers[0] & 0x7f;
        const uint8_t minute_bcd = registers[1] & 0x7f;
        const uint8_t hour_bcd = registers[2] & 0x3f;
        const uint8_t weekday = registers[3];
        const uint8_t day_bcd = registers[4] & 0x3f;
        const uint8_t month_bcd = registers[5] & 0x1f;
        const uint8_t year_bcd = registers[6];
        if (!ValidBcd(second_bcd) || !ValidBcd(minute_bcd) || !ValidBcd(hour_bcd) ||
            !ValidBcd(day_bcd) || !ValidBcd(month_bcd) || !ValidBcd(year_bcd) || weekday == 0 ||
            (weekday & (weekday - 1)) != 0) {
            return false;
        }

        const int second = FromBcd(second_bcd);
        const int minute = FromBcd(minute_bcd);
        const int hour = FromBcd(hour_bcd);
        const int day = FromBcd(day_bcd);
        const int month = FromBcd(month_bcd);
        const int year = 2000 + FromBcd(year_bcd);
        if (year < 2024 || month < 1 || month > 12 || day < 1 || day > DaysInMonth(year, month) ||
            hour > 23 || minute > 59 || second > 59) {
            return false;
        }
        const int64_t seconds =
            DaysFromCivil(year, month, day) * 86400LL + hour * 3600LL + minute * 60LL + second;
        value = static_cast<time_t>(seconds);
        return true;
    }

