doublemarkpro/ESP32-HanDictionary/main/boards/m5stack/tab5/m5stack_tab5.cc
    bool WriteTime(time_t value) const {
        if (device_ == nullptr || value < 1704067200)
            return false;
        struct tm utc{};
        gmtime_r(&value, &utc);
        const std::array<uint8_t, 8> bytes = {
            0x10,
            ToBcd(utc.tm_sec),
            ToBcd(utc.tm_min),
            ToBcd(utc.tm_hour),
            static_cast<uint8_t>(1U << utc.tm_wday),
            ToBcd(utc.tm_mday),
            ToBcd(utc.tm_mon + 1),
            ToBcd((utc.tm_year + 1900) % 100),
        };
        return i2c_master_transmit(device_, bytes.data(), bytes.size(), 100) == ESP_OK;
    }

private:
    static bool ValidBcd(uint8_t value) { return (value & 0x0f) <= 9 && (value >> 4) <= 9; }
    static uint8_t FromBcd(uint8_t value) { return (value >> 4) * 10 + (value & 0x0f); }
    static uint8_t ToBcd(int value) {
        return static_cast<uint8_t>(((value / 10) << 4) | (value % 10));
    }
    static bool LeapYear(int year) { return year % 4 == 0 && (year % 100 != 0 || year % 400 == 0); }
    static int DaysInMonth(int year, int month) {
        static constexpr int days[] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
        return month == 2 && LeapYear(year) ? 29 : days[month - 1];
    }
    static int64_t DaysFromCivil(int year, unsigned month, unsigned day) {
        year -= month <= 2;
        const int era = (year >= 0 ? year : year - 399) / 400;
        const unsigned year_of_era = static_cast<unsigned>(year - era * 400);
        const unsigned adjusted_month = month > 2 ? month - 3 : month + 9;
        const unsigned day_of_year = (153 * adjusted_month + 2) / 5 + day - 1;
        const unsigned day_of_era =
            year_of_era * 365 + year_of_era / 4 - year_of_era / 100 + day_of_year;
        return era * 146097LL + static_cast<int64_t>(day_of_era) - 719468;
    }
    bool ReadRegister(uint8_t reg, uint8_t& value) const {
        return i2c_master_transmit_receive(device_, &reg, 1, &value, 1, 100) == ESP_OK;
    }
    bool ReadRegisters(uint8_t reg, uint8_t* data, size_t size) const {
        return i2c_master_transmit_receive(device_, &reg, 1, data, size, 100) == ESP_OK;
    }
    bool WriteRegister(uint8_t reg, uint8_t value) const {
        const uint8_t bytes[] = {reg, value};
        return i2c_master_transmit(device_, bytes, sizeof(bytes), 100) == ESP_OK;
    }

    i2c_master_dev_handle_t device_ = nullptr;
};

class Tab5PowerMonitor {
public:
    bool Initialize(i2c_master_bus_handle_t bus) {
        i2c_device_config_t config = {
            .dev_addr_length = I2C_ADDR_BIT_LEN_7,
            .device_address = 0x41,
            .scl_speed_hz = 400 * 1000,
            .scl_wait_us = 0,
            .flags = {},
        };
        auto err = i2c_master_bus_add_device(bus, &config, &device_);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Could not attach INA226: %s", esp_err_to_name(err));
            return false;
        }
        uint16_t die_id = 0;
        if (!ReadRegister(0xFF, die_id) || die_id != 0x2260) {
            ESP_LOGW(TAG, "INA226 not detected (die id 0x%04x)", die_id);
            i2c_master_bus_rm_device(device_);
            device_ = nullptr;
            return false;
        }
        // Match the official M5Unified Tab5 setup: 16 samples, 1.1 ms shunt/bus
        // conversion, continuous shunt+bus mode, 5 mOhm shunt, 2 A expected maximum.
        if (!WriteRegister(0x00, 0x0527) || !WriteRegister(0x05, 0x4189)) {
            ESP_LOGW(TAG, "Could not configure INA226");
            i2c_master_bus_rm_device(device_);
            device_ = nullptr;
            return false;
        }
        uint16_t millivolts = 0;
        int current_ma = 0;
        if (Read(millivolts, current_ma))
            ESP_LOGI(TAG, "INA226 ready: battery=%u mV current=%d mA", millivolts, current_ma);
        return true;
    }

    bool Read(uint16_t& millivolts, int& current_ma) {
        uint16_t bus_raw = 0, shunt_raw = 0;
        if (device_ == nullptr || !ReadRegister(0x02, bus_raw) || !ReadRegister(0x01, shunt_raw))
            return false;
        millivolts = static_cast<uint16_t>((static_cast<uint32_t>(bus_raw) * 5) / 4);
        // 2.5 uV per bit / 5 mOhm = 0.5 mA per bit. On Tab5, charge current is
        // negative at the shunt, so expose positive current for charging.
        current_ma = -static_cast<int16_t>(shunt_raw) / 2;
        return millivolts >= 5000 && millivolts <= 9000;
    }

private:
    bool ReadRegister(uint8_t reg, uint16_t& value) {
        uint8_t bytes[2]{};
        auto err = i2c_master_transmit_receive(device_, &reg, 1, bytes, sizeof(bytes), 100);
        if (err != ESP_OK)
            return false;
        value = static_cast<uint16_t>(bytes[0] << 8 | bytes[1]);
        return true;
    }

    bool WriteRegister(uint8_t reg, uint16_t value) {
        uint8_t bytes[] = {reg, static_cast<uint8_t>(value >> 8), static_cast<uint8_t>(value)};
        return i2c_master_transmit(device_, bytes, sizeof(bytes), 100) == ESP_OK;
    }

    i2c_master_dev_handle_t device_ = nullptr;
};

int Tab5BatteryLevelFromVoltage(uint16_t pack_mv) {
    // The Tab5 battery is a 2-cell Li-ion pack. Voltage is not a coulomb counter, so use a
    // conservative discharge curve instead of presenting the pack voltage as a linear gauge.
    struct Point {
        int cell_mv;
        int level;
    };
    static constexpr Point curve[] = {
        {3000, 0},  {3400, 5},  {3600, 15}, {3700, 30},  {3800, 50},
        {3900, 70}, {4000, 85}, {4100, 97}, {4150, 100},
    };
    const int cell_mv = pack_mv / 2;
    if (cell_mv <= curve[0].cell_mv)
        return curve[0].level;
    for (size_t index = 1; index < std::size(curve); ++index) {
        if (cell_mv <= curve[index].cell_mv) {
            const auto& low = curve[index - 1];
            const auto& high = curve[index];
            return low.level + (cell_mv - low.cell_mv) * (high.level - low.level) /
                                   (high.cell_mv - low.cell_mv);
        }
    }
    return 100;
}

class M5StackTab5Board : public WifiBoard {
private:
    i2c_master_bus_handle_t i2c_bus_;
    std::unique_ptr<Button> boot_button_;
    LcdDisplay* display_;
    EspVideo* camera_ = nullptr;
    Pi4ioe1* pi4ioe1_;
    Pi4ioe2* pi4ioe2_;
    Tab5PowerMonitor power_monitor_;
    bool power_monitor_ready_ = false;
    Tab5Rtc rtc_;
    bool rtc_ready_ = false;
    esp_lcd_touch_handle_t touch_ = nullptr;
#if CONFIG_HAN_DICTIONARY
    sdmmc_card_t* sd_card_ = nullptr;
    bool sd_bus_initialized_ = false;
    bool sd_card_mounted_ = false;
    esp_ldo_channel_handle_t sd_card_power_ = nullptr;
    tinyusb_msc_storage_handle_t usb_storage_ = nullptr;
    bool tinyusb_driver_started_ = false;
    std::unique_ptr<Tab5Keyboard> keyboard_;
#endif

    void InitializeI2c() {
        i2c_master_bus_config_t i2c_bus_cfg = {
            .i2c_port = (i2c_port_t)1,
            .sda_io_num = AUDIO_CODEC_I2C_SDA_PIN,
            .scl_io_num = AUDIO_CODEC_I2C_SCL_PIN,
            .clk_source = I2C_CLK_SRC_DEFAULT,
            .glitch_ignore_cnt = 7,
            .intr_priority = 0,
            .trans_queue_depth = 0,
            .flags =
                {
                    .enable_internal_pullup = 1,
                },
        };
        ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_bus_cfg, &i2c_bus_));
    }

    void InitializeRtc() {
        rtc_ready_ = rtc_.Initialize(i2c_bus_);
        if (!rtc_ready_)
            return;

        time_t stored_time = 0;
        if (rtc_.ReadTime(stored_time)) {
            struct timeval value{};
            value.tv_sec = stored_time;
            if (settimeofday(&value, nullptr) == 0)
                ESP_LOGI(TAG, "System time restored from RX8130CE RTC: %lld",
                         static_cast<long long>(stored_time));
        } else {
            ESP_LOGW(TAG, "RX8130CE RTC has no valid retained time; waiting for network sync");
        }

        xTaskCreate(
            [](void* context) {
                auto self = static_cast<M5StackTab5Board*>(context);
                // The OTA response performs network time synchronization. Periodically compare it
                // with the hardware RTC so a later reset can restore the corrected wall clock.
                for (;;) {
                    // Poll quickly enough to persist the first server correction before a user can
                    // immediately reset the unit. Once both clocks agree, this remains a cheap
                    // one-second I2C check and writes only when their difference exceeds 3 seconds.
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    const time_t system_time = time(nullptr);
                    if (system_time < 1735689600)
                        continue;
                    time_t rtc_time = 0;
                    if (!self->rtc_.ReadTime(rtc_time) ||
                        std::llabs(static_cast<long long>(system_time) -
                                   static_cast<long long>(rtc_time)) > 3) {
                        if (self->rtc_.WriteTime(system_time))
                            ESP_LOGI(TAG, "RX8130CE RTC synchronized from system time");
                    }
                }
            },
            "tab5_rtc_sync", 3072, this, 1, nullptr);
    }

    static esp_err_t bsp_enable_dsi_phy_power() {
        esp_ldo_channel_handle_t ldo_mipi_phy = NULL;
        esp_ldo_channel_config_t ldo_mipi_phy_config = {
            .chan_id = LCD_MIPI_DSI_PHY_PWR_LDO_CHAN,
            .voltage_mv = LCD_MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV,
        };
        return esp_ldo_acquire_channel(&ldo_mipi_phy_config, &ldo_mipi_phy);
    }

    void I2cDetect() {
        uint8_t address;
        printf("     0  1  2  3  4  5  6  7  8  9  a  b  c  d  e  f\r\n");
        for (int i = 0; i < 128; i += 16) {
            printf("%02x: ", i);
            for (int j = 0; j < 16; j++) {
                fflush(stdout);
                address = i + j;
                esp_err_t ret = i2c_master_probe(i2c_bus_, address, pdMS_TO_TICKS(200));
                if (ret == ESP_OK) {
                    printf("%02x ", address);
                } else if (ret == ESP_ERR_TIMEOUT) {
                    printf("UU ");
                } else {
                    printf("-- ");
                }
            }
            printf("\r\n");
        }
    }

