doublemarkpro/ESP32-HanDictionary/main/boards/m5stack/tab5/m5stack_tab5.cc
    void InitializePi4ioe() {
        ESP_LOGI(TAG, "Init I/O Exapander PI4IOE");
        pi4ioe1_ = new Pi4ioe1(i2c_bus_, 0x43);
        pi4ioe2_ = new Pi4ioe2(i2c_bus_, 0x44);
    }

    void ResetLcdAndTouch() {
        ESP_LOGI(TAG, "Reset LCD and touch via PI4IOE");
        gpio_reset_pin(TOUCH_INT_GPIO);

        uint8_t value = pi4ioe1_->ReadOutSet();
        clrbit(value, 4);  // P4 = LCD_RST
        clrbit(value, 5);  // P5 = TP_RST
        pi4ioe1_->WriteOutSet(value);
        vTaskDelay(pdMS_TO_TICKS(100));

        setbit(value, 4);
        setbit(value, 5);
        pi4ioe1_->WriteOutSet(value);
        vTaskDelay(pdMS_TO_TICKS(100));
    }

    static esp_lcd_panel_io_i2c_config_t St712xTouchIoConfig() {
        esp_lcd_panel_io_i2c_config_t config = {};
        config.scl_speed_hz = 100000;
        config.dev_addr = ST712X_TOUCH_I2C_ADDRESS;
        config.control_phase_bytes = 1;
        config.lcd_cmd_bits = 16;
        config.flags.disable_control_phase = 1;
        return config;
    }

    St712xPanel DetectSt712xPanel() {
        esp_lcd_panel_io_handle_t touch_io = nullptr;
        auto touch_io_config = St712xTouchIoConfig();
        esp_err_t ret = esp_lcd_new_panel_io_i2c(i2c_bus_, &touch_io_config, &touch_io);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to create ST712x detection IO (%s); falling back to ST7123",
                     esp_err_to_name(ret));
            return St712xPanel::kSt7123;
        }

        uint8_t firmware_version = 0;
        ret = esp_lcd_panel_io_rx_param(touch_io, 0x0000, &firmware_version,
                                        sizeof(firmware_version));
        esp_lcd_panel_io_del(touch_io);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "Failed to read ST712x firmware version (%s); falling back to ST7123",
                     esp_err_to_name(ret));
            return St712xPanel::kSt7123;
        }

        if (firmware_version == 1) {
            ESP_LOGI(TAG, "Detected ST7121 panel (touch firmware version %u)", firmware_version);
            return St712xPanel::kSt7121;
        }
        if (firmware_version != 3) {
            ESP_LOGW(TAG, "Unknown ST712x touch firmware version %u; falling back to ST7123",
                     firmware_version);
        } else {
            ESP_LOGI(TAG, "Detected ST7123 panel (touch firmware version %u)", firmware_version);
        }
        return St712xPanel::kSt7123;
    }

    void InitializeButtons() {
        if (!boot_button_)
            return;
        boot_button_->OnClick([this]() {
            auto& app = Application::GetInstance();
            if (app.GetDeviceState() == kDeviceStateStarting) {
                EnterWifiConfigMode();
                return;
            }
            app.ToggleChatState();
        });
    }

#if CONFIG_HAN_DICTIONARY
    void InitializeKeyboard(HanDisplay* product) {
        keyboard_ = std::make_unique<Tab5Keyboard>();
        if (keyboard_->Initialize(
                [product](const std::string& input) {
                    Application::GetInstance().Schedule(
                        [product, input] { product->HandleKeyboardInput(input); });
                },
                [product](bool connected) {
                    if (!connected)
                        return;
                    Application::GetInstance().Schedule(
                        [product] { product->ShowKeyboardConnected(); });
                })) {
            return;
        }
        keyboard_.reset();
        // ExtPort1 shares GPIO0 with the BOOT key. A failed I2C watcher can safely release that
        // pin back to the ordinary button implementation.
        boot_button_ = std::make_unique<Button>(BOOT_BUTTON_GPIO);
        ESP_LOGW(TAG, "Tab5 Keyboard watcher unavailable; BOOT button enabled");
    }
#endif

    void InitializeGt911TouchPad() {
        ESP_LOGI(TAG, "Init GT911");

        /* Initialize Touch Panel */
        ESP_LOGI(TAG, "Initialize touch IO (I2C)");
        const esp_lcd_touch_config_t tp_cfg = {
            .x_max = DISPLAY_WIDTH,
            .y_max = DISPLAY_HEIGHT,
            .rst_gpio_num = GPIO_NUM_NC,
            .int_gpio_num = TOUCH_INT_GPIO,
            .levels =
                {
                    .reset = 0,
                    .interrupt = 0,
                },
            .flags =
                {
                    .swap_xy = 0,
                    .mirror_x = 0,
                    .mirror_y = 0,
                },
        };
        esp_lcd_panel_io_handle_t tp_io_handle = NULL;
        esp_lcd_panel_io_i2c_config_t tp_io_config = {
            .dev_addr = ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS,
            .control_phase_bytes = 1,
            .dc_bit_offset = 0,
            .lcd_cmd_bits = 16,
            .flags = {
                .disable_control_phase = 1,
            }};
        tp_io_config.dev_addr = ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS_BACKUP;  // 更改 GT911 地址
        tp_io_config.scl_speed_hz = 100000;
        esp_lcd_new_panel_io_i2c(i2c_bus_, &tp_io_config, &tp_io_handle);
        esp_lcd_touch_new_i2c_gt911(tp_io_handle, &tp_cfg, &touch_);
    }

    void InitializeIli9881cDisplay() {
        esp_lcd_panel_io_handle_t panel_io = nullptr;
        esp_lcd_panel_handle_t panel = nullptr;

        ESP_LOGI(TAG, "Turn on the power for MIPI DSI PHY");
        esp_ldo_channel_handle_t ldo_mipi_phy = NULL;
        esp_ldo_channel_config_t ldo_mipi_phy_config = {
            .chan_id = LCD_MIPI_DSI_PHY_PWR_LDO_CHAN,
            .voltage_mv = LCD_MIPI_DSI_PHY_PWR_LDO_VOLTAGE_MV,
        };
        ESP_ERROR_CHECK(esp_ldo_acquire_channel(&ldo_mipi_phy_config, &ldo_mipi_phy));

        ESP_LOGI(TAG, "Install MIPI DSI LCD control panel");
        esp_lcd_dsi_bus_handle_t mipi_dsi_bus;
        esp_lcd_dsi_bus_config_t bus_config = {
            .bus_id = 0,
            .num_data_lanes = 2,
            .lane_bit_rate_mbps = 900,  // 900MHz
        };
        ESP_ERROR_CHECK(esp_lcd_new_dsi_bus(&bus_config, &mipi_dsi_bus));

        ESP_LOGI(TAG, "Install panel IO");
        esp_lcd_dbi_io_config_t dbi_config = {
            .virtual_channel = 0,
            .lcd_cmd_bits = 8,
            .lcd_param_bits = 8,
        };
        ESP_ERROR_CHECK(esp_lcd_new_panel_io_dbi(mipi_dsi_bus, &dbi_config, &panel_io));

        ESP_LOGI(TAG, "Install LCD driver of ili9881c");
        esp_lcd_dpi_panel_config_t dpi_config = {
            .virtual_channel = 0,
            .dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT,
            .dpi_clock_freq_mhz = 60,
            .in_color_format = LCD_COLOR_FMT_RGB565,
            .out_color_format = LCD_COLOR_FMT_RGB565,
            .num_fbs = 2,
            .video_timing =
                {
                    .h_size = DISPLAY_WIDTH,
                    .v_size = DISPLAY_HEIGHT,
                    .hsync_pulse_width = 40,
                    .hsync_back_porch = 140,
                    .hsync_front_porch = 40,
                    .vsync_pulse_width = 4,
                    .vsync_back_porch = 20,
                    .vsync_front_porch = 20,
                },
        };
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6, 0, 0)
        dpi_config.flags.use_dma2d = true;
#endif

        ili9881c_vendor_config_t vendor_config = {
            .init_cmds = tab5_lcd_ili9881c_specific_init_code_default,
            .init_cmds_size = sizeof(tab5_lcd_ili9881c_specific_init_code_default) /
                              sizeof(tab5_lcd_ili9881c_specific_init_code_default[0]),
            .mipi_config =
                {
                    .dsi_bus = mipi_dsi_bus,
                    .dpi_config = &dpi_config,
                    .lane_num = 2,
                },
        };

        esp_lcd_panel_dev_config_t lcd_dev_config = {};
        lcd_dev_config.rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB;
        lcd_dev_config.reset_gpio_num = GPIO_NUM_NC;
        lcd_dev_config.bits_per_pixel = 16;
        lcd_dev_config.vendor_config = &vendor_config;

        ESP_ERROR_CHECK(esp_lcd_new_panel_ili9881c(panel_io, &lcd_dev_config, &panel));
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
        ESP_ERROR_CHECK(esp_lcd_dpi_panel_enable_dma2d(panel));
#endif
        ESP_ERROR_CHECK(esp_lcd_panel_reset(panel));
        ESP_ERROR_CHECK(esp_lcd_panel_init(panel));
        ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(panel, true));

        display_ = new Tab5ProductDisplay(panel_io, panel, DISPLAY_WIDTH, DISPLAY_HEIGHT,
                                          DISPLAY_OFFSET_X, DISPLAY_OFFSET_Y, DISPLAY_MIRROR_X,
                                          DISPLAY_MIRROR_Y, DISPLAY_SWAP_XY, kTab5DisplayConfig);
    }

    void InitializeSt712xDisplay(St712xPanel panel_type) {
        const bool is_st7121 = panel_type == St712xPanel::kSt7121;
        const char* panel_name = is_st7121 ? "ST7121" : "ST7123";
        esp_err_t ret = ESP_OK;
        esp_lcd_panel_io_handle_t io = NULL;
        esp_lcd_panel_handle_t disp_panel = NULL;
        esp_lcd_dsi_bus_handle_t mipi_dsi_bus = NULL;

        // Declare all config structures at the top to avoid goto issues
        // Initialize with memset to avoid any initialization syntax that might confuse the compiler
        esp_lcd_dsi_bus_config_t bus_config;
        esp_lcd_dbi_io_config_t dbi_config;
        esp_lcd_dpi_panel_config_t dpi_config;
        st7121_vendor_config_t st7121_vendor_config;
        st7123_vendor_config_t st7123_vendor_config;
        esp_lcd_panel_dev_config_t lcd_dev_config;

        memset(&bus_config, 0, sizeof(bus_config));
        memset(&dbi_config, 0, sizeof(dbi_config));
        memset(&dpi_config, 0, sizeof(dpi_config));
        memset(&st7121_vendor_config, 0, sizeof(st7121_vendor_config));
        memset(&st7123_vendor_config, 0, sizeof(st7123_vendor_config));
        memset(&lcd_dev_config, 0, sizeof(lcd_dev_config));

