doublemarkpro/ESP32-HanDictionary/main/boards/m5stack/tab5/m5stack_tab5.cc
        ESP_ERROR_CHECK(bsp_enable_dsi_phy_power());

        /* create MIPI DSI bus first, it will initialize the DSI PHY as well */
        bus_config.bus_id = 0;
        bus_config.num_data_lanes = 2;
        bus_config.lane_bit_rate_mbps = 965;
        ret = esp_lcd_new_dsi_bus(&bus_config, &mipi_dsi_bus);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "New DSI bus init failed");
            goto err;
        }

        ESP_LOGI(TAG, "Install MIPI DSI LCD control panel for %s", panel_name);
        // we use DBI interface to send LCD commands and parameters
        dbi_config.virtual_channel = 0;
        dbi_config.lcd_cmd_bits = 8;    // according to the LCD spec
        dbi_config.lcd_param_bits = 8;  // according to the LCD spec
        ret = esp_lcd_new_panel_io_dbi(mipi_dsi_bus, &dbi_config, &io);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "New panel IO failed");
            goto err;
        }

        ESP_LOGI(TAG, "Install LCD driver of %s", panel_name);
        dpi_config.virtual_channel = 0;
        dpi_config.dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT;
        dpi_config.dpi_clock_freq_mhz = 70;
        dpi_config.in_color_format = LCD_COLOR_FMT_RGB565;
        dpi_config.out_color_format = LCD_COLOR_FMT_RGB565;
        dpi_config.num_fbs = 1;
        dpi_config.video_timing.h_size = 720;
        dpi_config.video_timing.v_size = 1280;
        dpi_config.video_timing.hsync_pulse_width = 2;
        dpi_config.video_timing.hsync_back_porch = 40;
        dpi_config.video_timing.hsync_front_porch = 40;
        dpi_config.video_timing.vsync_pulse_width = is_st7121 ? 20 : 2;
        dpi_config.video_timing.vsync_back_porch = is_st7121 ? 24 : 8;
        dpi_config.video_timing.vsync_front_porch = is_st7121 ? 200 : 220;
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6, 0, 0)
        dpi_config.flags.use_dma2d = true;
#endif

        lcd_dev_config.reset_gpio_num = GPIO_NUM_NC;
        lcd_dev_config.rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB;
        lcd_dev_config.data_endian = LCD_RGB_DATA_ENDIAN_LITTLE;
        lcd_dev_config.bits_per_pixel = 24;
        if (is_st7121) {
            st7121_vendor_config.mipi_config.dsi_bus = mipi_dsi_bus;
            st7121_vendor_config.mipi_config.dpi_config = &dpi_config;
            lcd_dev_config.vendor_config = &st7121_vendor_config;
            ret = esp_lcd_new_panel_st7121(io, &lcd_dev_config, &disp_panel);
        } else {
            st7123_vendor_config.init_cmds = st7123_vendor_specific_init_default;
            st7123_vendor_config.init_cmds_size = sizeof(st7123_vendor_specific_init_default) /
                                                  sizeof(st7123_vendor_specific_init_default[0]);
            st7123_vendor_config.mipi_config.dsi_bus = mipi_dsi_bus;
            st7123_vendor_config.mipi_config.dpi_config = &dpi_config;
            st7123_vendor_config.mipi_config.lane_num = 2;
            lcd_dev_config.vendor_config = &st7123_vendor_config;
            ret = esp_lcd_new_panel_st7123(io, &lcd_dev_config, &disp_panel);
        }
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "New LCD panel %s failed", panel_name);
            goto err;
        }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
        ret = esp_lcd_dpi_panel_enable_dma2d(disp_panel);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Enable DPI DMA2D failed");
            goto err;
        }
#endif

        ret = esp_lcd_panel_reset(disp_panel);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "LCD panel reset failed");
            goto err;
        }

        ret = esp_lcd_panel_init(disp_panel);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "LCD panel init failed");
            goto err;
        }

        ret = esp_lcd_panel_disp_on_off(disp_panel, true);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "LCD panel display on failed");
            goto err;
        }

        display_ = new Tab5ProductDisplay(io, disp_panel, 720, 1280, DISPLAY_OFFSET_X,
                                          DISPLAY_OFFSET_Y, DISPLAY_MIRROR_X, DISPLAY_MIRROR_Y,
                                          DISPLAY_SWAP_XY, kTab5DisplayConfig);

        ESP_LOGI(TAG, "%s display initialized with resolution %dx%d", panel_name, 720, 1280);

        return;

    err:
        if (disp_panel) {
            esp_lcd_panel_del(disp_panel);
        }
        if (io) {
            esp_lcd_panel_io_del(io);
        }
        if (mipi_dsi_bus) {
            esp_lcd_del_dsi_bus(mipi_dsi_bus);
        }
        ESP_ERROR_CHECK(ret);
    }

    void InitializeSt712xTouchPad() {
        ESP_LOGI(TAG, "Init ST712x touch");

        /* Initialize Touch Panel */
        ESP_LOGI(TAG, "Initialize touch IO (I2C)");
        const esp_lcd_touch_config_t tp_cfg = {
            .x_max = 720,
            .y_max = 1280,
            .rst_gpio_num = GPIO_NUM_NC,
            .int_gpio_num = TOUCH_INT_GPIO,
            .levels =
                {
                    .reset = 0,
                    .interrupt = 0,
                },
            .flags =
                {
                    .swap_xy = 0,
                    .mirror_x = 0,
                    .mirror_y = 0,
                },
        };
        esp_lcd_panel_io_handle_t tp_io_handle = NULL;
        auto tp_io_config = St712xTouchIoConfig();
        ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_bus_, &tp_io_config, &tp_io_handle));
        ESP_ERROR_CHECK(esp_lcd_touch_new_i2c_st7123(tp_io_handle, &tp_cfg, &touch_));
    }

    void InitializeDisplay() {
        ResetLcdAndTouch();

        esp_err_t ret = i2c_master_probe(i2c_bus_, ST712X_TOUCH_I2C_ADDRESS, 200);
        if (ret == ESP_OK) {
            St712xPanel panel_type = DetectSt712xPanel();
            InitializeSt712xDisplay(panel_type);
            InitializeSt712xTouchPad();
        } else {
            ESP_LOGI(TAG, "ST712x not found at 0x%02X (ret=0x%x), using default ILI9881C+GT911",
                     ST712X_TOUCH_I2C_ADDRESS, ret);
            InitializeIli9881cDisplay();
            InitializeGt911TouchPad();
        }
    }

    void InitializeCamera() {
        esp_cam_sensor_xclk_handle_t xclk_handle = NULL;
        esp_cam_sensor_xclk_config_t cam_xclk_config = {};

#if CONFIG_CAMERA_XCLK_USE_ESP_CLOCK_ROUTER
        if (esp_cam_sensor_xclk_allocate(ESP_CAM_SENSOR_XCLK_ESP_CLOCK_ROUTER, &xclk_handle) ==
            ESP_OK) {
            cam_xclk_config.esp_clock_router_cfg.xclk_pin = CAMERA_MCLK;
            cam_xclk_config.esp_clock_router_cfg.xclk_freq_hz = 12000000;  // 12MHz
            (void)esp_cam_sensor_xclk_start(xclk_handle, &cam_xclk_config);
        }
#elif CONFIG_CAMERA_XCLK_USE_LEDC
        if (esp_cam_sensor_xclk_allocate(ESP_CAM_SENSOR_XCLK_LEDC, &xclk_handle) == ESP_OK) {
            cam_xclk_config.ledc_cfg.timer = LEDC_TIMER_0;
            cam_xclk_config.ledc_cfg.clk_cfg = LEDC_AUTO_CLK;
            cam_xclk_config.ledc_cfg.channel = LEDC_CHANNEL_0;
            cam_xclk_config.ledc_cfg.xclk_freq_hz = 12000000;  // 12MHz
            cam_xclk_config.ledc_cfg.xclk_pin = CAMERA_MCLK;
            (void)esp_cam_sensor_xclk_start(xclk_handle, &cam_xclk_config);
        }
#endif

