doublemarkpro/ESP32-HanDictionary/main/boards/m5stack/tab5/m5stack_tab5.cc
        esp_video_init_sccb_config_t sccb_config = {
            .init_sccb = false,
            .i2c_handle = i2c_bus_,
            .freq = 400000,
        };

        esp_video_init_csi_config_t csi_config = {
            .sccb_config = sccb_config,
            .reset_pin = GPIO_NUM_NC,
            .pwdn_pin = GPIO_NUM_NC,
        };

        esp_video_init_config_t video_config = {
            .csi = &csi_config,
        };

        camera_ = new EspVideo(video_config);
    }

public:
    M5StackTab5Board() {
        InitializeI2c();
        I2cDetect();
        InitializeRtc();
        InitializePi4ioe();
        power_monitor_ready_ = power_monitor_.Initialize(i2c_bus_);
        InitializeDisplay();  // Auto-detect and initialize display + touch
#if CONFIG_HAN_DICTIONARY
        auto product = static_cast<HanDisplay*>(display_);
        product->AttachTouch(touch_);
        product->SetNetworkAction([this] {
            if (!IsInWifiConfigMode())
                EnterWifiConfigMode();
        });
        product->SetUsbStorageAction([this] { return StartUsbStorageMode(); });
        product->SetUsbStorageRestoreAction([this] { return StopUsbStorageMode(); });
        // A164 is powered by ExtPort1. Enable it before starting the hot-plug watcher so a keyboard
        // inserted after boot can answer the periodic I2C probe.
        SetExt5vEn(true);
        InitializeKeyboard(product);
        InitializeContentCard();
        DictionaryService::GetInstance().SetResultCallback(
            [product](const han::Entry& entry, bool auto_play_strokes) {
                Application::GetInstance().Schedule([product, entry, auto_play_strokes] {
                    product->ShowEntry(entry, auto_play_strokes);
                });
            });
        McpServer::GetInstance().AddTool(
            "self.study.open",
            "打开学习界面。page可选home、dictionary、phonetics、timetable、timer、alarm、weather、n"
            "etwork。用户说学习英语音标时传phonetics。本工具只导航，不会设置闹钟或开始计时。",
            PropertyList({Property("page", kPropertyTypeString)}),
            [product](const PropertyList& args) -> ReturnValue {
                return product->OpenPage(args["page"].value<std::string>());
            });
#endif
        InitializeCamera();
#if !CONFIG_HAN_DICTIONARY
        boot_button_ = std::make_unique<Button>(BOOT_BUTTON_GPIO);
#endif
        InitializeButtons();
        SetChargeQcEn(true);
        SetChargeEn(true);
#if CONFIG_HAN_DICTIONARY
        // The dictionary product does not use the outward-facing 5 V rails. Leaving both boost
        // converters enabled wastes battery even while the screen is off.
        SetUsb5vEn(false);
        // ExtPort1 remains powered for keyboard hot-plug detection. GPIO0 is its I2C SDA line, so
        // the dictionary build deliberately does not install a competing BOOT-button handler.
        SetExt5vEn(true);
#else
        SetUsb5vEn(true);
        SetExt5vEn(true);
#endif
        GetBacklight()->RestoreBrightness();
#if CONFIG_HAN_DICTIONARY
        DictionaryService::GetInstance().RegisterMcpTools();
#endif
    }

    virtual AudioCodec* GetAudioCodec() override {
        static Tab5AudioCodec audio_codec(
            i2c_bus_, AUDIO_INPUT_SAMPLE_RATE, AUDIO_OUTPUT_SAMPLE_RATE, AUDIO_I2S_GPIO_MCLK,
            AUDIO_I2S_GPIO_BCLK, AUDIO_I2S_GPIO_WS, AUDIO_I2S_GPIO_DOUT, AUDIO_I2S_GPIO_DIN,
            AUDIO_CODEC_PA_PIN, AUDIO_CODEC_ES8388_ADDR, AUDIO_CODEC_ES7210_ADDR,
            AUDIO_INPUT_REFERENCE);
        return &audio_codec;
    }

    virtual Display* GetDisplay() override { return display_; }

    virtual Camera* GetCamera() override { return camera_; }

    virtual Backlight* GetBacklight() override {
        static PwmBacklight backlight(DISPLAY_BACKLIGHT_PIN, DISPLAY_BACKLIGHT_OUTPUT_INVERT);
        return &backlight;
    }

    bool GetBatteryInfo(BatteryInfo& info) override {
        info = {};
        uint16_t voltage_mv = 0;
        if (!power_monitor_ready_ || !power_monitor_.Read(voltage_mv, info.current_ma))
            return false;

        info.voltage_mv = voltage_mv;
        info.level = Tab5BatteryLevelFromVoltage(voltage_mv);

        uint8_t input = 0;
        if (pi4ioe2_->ReadInput(input)) {
            info.charging = (input & (1U << 6)) != 0;  // P6 = CHG_STAT, matches M5Unified.
            info.discharging = !info.charging && info.current_ma < -10;
        } else {
            info.charging = info.current_ma > 10;
            info.discharging = info.current_ma < -10;
        }
        return true;
    }

    bool GetBatteryLevel(int& level, bool& charging, bool& discharging) override {
        BatteryInfo info;
        if (!GetBatteryInfo(info))
            return false;
        level = info.level;
        charging = info.charging;
        discharging = info.discharging;
        return true;
    }

    // BSP power control functions
#if CONFIG_HAN_DICTIONARY
    esp_err_t EnableContentCardPower() {
        if (sd_card_power_)
            return ESP_OK;
        const esp_ldo_channel_config_t config = {
            .chan_id = SD_CARD_PWR_LDO_CHAN,
            .voltage_mv = SD_CARD_PWR_LDO_VOLTAGE_MV,
        };
        auto err = esp_ldo_acquire_channel(&config, &sd_card_power_);
        if (err == ESP_OK) {
            // Give the card rail time to settle before the first command. Without this explicit
            // enable, the card only worked accidentally when an earlier firmware left LDO4 on.
            vTaskDelay(pdMS_TO_TICKS(20));
            ESP_LOGI(TAG, "microSD power enabled from LDO4");
        }
        return err;
    }

    esp_err_t InitializeSdBus() {
        if (sd_bus_initialized_)
            return ESP_OK;
        auto err = EnableContentCardPower();
        if (err != ESP_OK)
            return err;
        // Official Tab5 SPI pins. Wi-Fi uses its separate SDIO bus; never reconfigure it.
        spi_bus_config_t bus{};
        bus.mosi_io_num = GPIO_NUM_44;
        bus.miso_io_num = GPIO_NUM_39;
        bus.sclk_io_num = GPIO_NUM_43;
        bus.quadwp_io_num = -1;
        bus.quadhd_io_num = -1;
        bus.max_transfer_sz = 8192;
        err = spi_bus_initialize(SPI2_HOST, &bus, SPI_DMA_CH_AUTO);
        if (err == ESP_OK)
            sd_bus_initialized_ = true;
        return err;
    }

    esp_err_t InitializeRawContentCard() {
        if (sd_card_)
            return ESP_OK;
        auto err = InitializeSdBus();
        if (err != ESP_OK)
            return err;
        err = sdspi_host_init();
        if (err != ESP_OK)
            return err;

        sdspi_device_config_t slot = SDSPI_DEVICE_CONFIG_DEFAULT();
        slot.host_id = SPI2_HOST;
        slot.gpio_cs = GPIO_NUM_42;
        sdspi_dev_handle_t device = -1;
        err = sdspi_host_init_device(&slot, &device);
        if (err != ESP_OK)
            return err;

        auto card = static_cast<sdmmc_card_t*>(calloc(1, sizeof(sdmmc_card_t)));
        if (!card) {
            sdspi_host_remove_device(device);
            return ESP_ERR_NO_MEM;
        }
        sdmmc_host_t host = SDSPI_HOST_DEFAULT();
        host.slot = device;
        host.max_freq_khz = kContentCardFrequencyKHz;
        err = sdmmc_card_init(&host, card);
        if (err != ESP_OK) {
            sdspi_host_remove_device(device);
            free(card);
            return err;
        }
        sd_card_ = card;
        ESP_LOGI(TAG, "SD card ready for raw access: %llu MiB",
                 static_cast<unsigned long long>(card->csd.capacity) * card->csd.sector_size /
                     (1024 * 1024));
        return ESP_OK;
    }

