doublemarkpro/ESP32-HanDictionary/main/boards/m5stack/tab5/m5stack_tab5.cc
    void InitializeContentCard() {
        auto err = InitializeSdBus();
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "SD SPI unavailable: %s", esp_err_to_name(err));
            return;
        }
        sdmmc_host_t host = SDSPI_HOST_DEFAULT();
        host.slot = SPI2_HOST;
        host.max_freq_khz = kContentCardFrequencyKHz;
        sdspi_device_config_t slot = SDSPI_DEVICE_CONFIG_DEFAULT();
        slot.host_id = SPI2_HOST;
        slot.gpio_cs = GPIO_NUM_42;
        esp_vfs_fat_sdmmc_mount_config_t mount{};
        mount.format_if_mount_failed = false;
        // Weather and settings pages can decode several SD images while content workers are
        // reading. Six descriptors were exhausted by file-backed fonts plus PNG decoders.
        mount.max_files = 12;
        mount.allocation_unit_size = 16 * 1024;
        err = esp_vfs_fat_sdspi_mount("/sdcard", &host, &slot, &mount, &sd_card_);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "No usable SD card (%s); using embedded sample", esp_err_to_name(err));
            spi_bus_free(SPI2_HOST);
            sd_bus_initialized_ = false;
            sd_card_ = nullptr;
            return;
        }
        sd_card_mounted_ = true;
        DictionaryService::GetInstance().store().Initialize();
    }

    std::string StartUsbStorageMode() {
#if !CONFIG_TINYUSB_MSC_ENABLED
        return "当前固件未启用 USB 读卡器";
#else
        if (usb_storage_)
            return {};

        auto& store = DictionaryService::GetInstance().store();
        store.Detach();
        if (sd_card_mounted_) {
            const auto err = esp_vfs_fat_sdcard_unmount("/sdcard", sd_card_);
            if (err != ESP_OK) {
                store.Initialize();
                return std::string("无法卸载 SD 卡：") + esp_err_to_name(err);
            }
            sd_card_ = nullptr;  // esp_vfs_fat_sdcard_unmount releases the descriptor.
            sd_card_mounted_ = false;
        }

        auto err = InitializeRawContentCard();
        if (err != ESP_OK)
            return std::string("无法读取 microSD 卡：") + esp_err_to_name(err);

        static char mount_path[] = "/sdcard";
        tinyusb_msc_storage_config_t storage_config{};
        storage_config.medium.card = sd_card_;
        storage_config.fat_fs.base_path = mount_path;
        storage_config.fat_fs.config.format_if_mount_failed = false;
        storage_config.fat_fs.config.max_files = 6;
        storage_config.fat_fs.config.allocation_unit_size = 16 * 1024;
        storage_config.fat_fs.do_not_format = true;
        storage_config.mount_point = TINYUSB_MSC_STORAGE_MOUNT_USB;
        err = tinyusb_msc_new_storage_sdmmc(&storage_config, &usb_storage_);
        if (err != ESP_OK) {
            usb_storage_ = nullptr;
            return std::string("USB 存储初始化失败：") + esp_err_to_name(err);
        }

        // Tab5 routes the USB-C connector to FSLS PHY 0, while the default ESP32-P4
        // TinyUSB configuration uses the high-speed controller connected to USB-A.
        // Start OTG1.1 first on the unused PHY, then atomically hand the external
        // USB-C PHY from USB-Serial/JTAG to TinyUSB. COM logging intentionally stops
        // after the swap and returns on the next reboot.
        tinyusb_config_t usb_config = TINYUSB_CONFIG_FULL_SPEED(nullptr, nullptr);
        err = tinyusb_driver_install(&usb_config);
        if (err != ESP_OK) {
            tinyusb_msc_delete_storage(usb_storage_);
            usb_storage_ = nullptr;
            return std::string("USB 设备启动失败：") + esp_err_to_name(err);
        }
        tinyusb_driver_started_ = true;
        tud_disconnect();
        vTaskDelay(pdMS_TO_TICKS(100));
        usb_wrap_ll_phy_select(&USB_WRAP, 0);
        vTaskDelay(pdMS_TO_TICKS(50));
        tud_connect();
        ESP_LOGI(TAG, "microSD is now exported as a USB mass-storage device");
        return {};
#endif
    }

    std::string StopUsbStorageMode() {
#if !CONFIG_TINYUSB_MSC_ENABLED
        return "当前固件未启用 USB 读卡器";
#else
        if (!usb_storage_) {
            usb_wrap_ll_phy_select(&USB_WRAP, 1);
            return {};
        }

        // The USB-C connector was handed from USB-Serial/JTAG to TinyUSB when MSC started.
        // Tear TinyUSB down completely before restoring that routing. A plain esp_restart()
        // does not reset the LP USB PHY selection register on ESP32-P4, leaving Windows with an
        // unresponsive device until a physical reset.
        if (tinyusb_driver_started_) {
            tud_disconnect();
            vTaskDelay(pdMS_TO_TICKS(250));
            const auto err = tinyusb_driver_uninstall();
            if (err != ESP_OK)
                return std::string("无法停止 USB 设备：") + esp_err_to_name(err);
            tinyusb_driver_started_ = false;
        }

        const auto err = tinyusb_msc_delete_storage(usb_storage_);
        if (err != ESP_OK)
            return std::string("请先在电脑安全弹出：") + esp_err_to_name(err);
        usb_storage_ = nullptr;

        // PHY 0 is the external USB-C port. Mapping USB_WRAP back to PHY 1 gives PHY 0 to
        // USB-Serial/JTAG again before the scheduled software restart.
        usb_wrap_ll_phy_select(&USB_WRAP, 1);
        vTaskDelay(pdMS_TO_TICKS(100));
        ESP_LOGI(TAG, "USB mass storage stopped; USB-C returned to USB-Serial/JTAG");
        return {};
#endif
    }
#endif
    void SetChargeQcEn(bool en) {
        if (pi4ioe2_) {
            uint8_t value = pi4ioe2_->ReadOutSet();
            if (en) {
                clrbit(value, 5);  // P5 = CHG_QC_EN (低电平使能)
            } else {
                setbit(value, 5);
            }
            pi4ioe2_->WriteOutSet(value);
        }
    }

    void SetChargeEn(bool en) {
        if (pi4ioe2_) {
            uint8_t value = pi4ioe2_->ReadOutSet();
            if (en) {
                setbit(value, 7);  // P7 = CHG_EN
            } else {
                clrbit(value, 7);
            }
            pi4ioe2_->WriteOutSet(value);
        }
    }

    void SetUsb5vEn(bool en) {
        if (pi4ioe2_) {
            uint8_t value = pi4ioe2_->ReadOutSet();
            if (en) {
                setbit(value, 3);  // P3 = USB5V_EN
            } else {
                clrbit(value, 3);
            }
            pi4ioe2_->WriteOutSet(value);
        }
    }

    void SetExt5vEn(bool en) {
        if (pi4ioe1_) {
            uint8_t value = pi4ioe1_->ReadOutSet();
            if (en) {
                setbit(value, 2);  // P2 = EXT5V_EN
            } else {
                clrbit(value, 2);
            }
            pi4ioe1_->WriteOutSet(value);
        }
    }
};

DECLARE_BOARD(M5StackTab5Board);
